docs: polish general architecture diagrams
